Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.Severity Property
 Gets or sets the issue severity
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelIssue.SeverityEnum Severity { get; set; }
Public Property Severity As AnalysisModelIssue.SeverityEnum
	Get
	Set
Property Value
Type: AnalysisModelIssue.SeverityEnum
See Also
Reference
AnalysisModelIssue Class
Tekla.Structures.Analysis Namespace